tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293.15;

boundaryField
{
    waterInlet  { type fixedValue; value uniform 293.15; }
    waterOutlet { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    airInlet    { type fixedValue; value uniform 293.15; }
    atmosphere  { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    walls       { type zeroGradient; }
    frontAndBack { type empty; }
}
