tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    waterInlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    waterOutlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    airInlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}
