tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/alpha.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    waterInlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    waterOutlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    airInlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
