tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 1e-6;

boundaryField
{
    waterInlet  { type calculated; value uniform 1e-6; }
    waterOutlet { type calculated; value uniform 1e-6; }
    airInlet    { type calculated; value uniform 1e-6; }
    atmosphere  { type calculated; value uniform 1e-6; }
    walls       { type compressible::alphatWallFunction; value uniform 1e-6; }
    frontAndBack { type empty; }
}
