tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-3;

boundaryField
{
    waterInlet  { type inletOutlet; inletValue uniform 1e-3; value uniform 1e-3; }
    waterOutlet { type inletOutlet; inletValue uniform 1e-3; value uniform 1e-3; }
    airInlet    { type inletOutlet; inletValue uniform 1e-3; value uniform 1e-3; }
    atmosphere  { type inletOutlet; inletValue uniform 1e-3; value uniform 1e-3; }
    walls       { type kqRWallFunction; value uniform 1e-3; }
    frontAndBack { type empty; }
}
