tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 131178.038592;

boundaryField
{
    waterInlet  { type calculated; value uniform 131667.753792; }
    waterOutlet { type calculated; value uniform 131178.038592; }
    airInlet    { type calculated; value uniform 130531.614528; }
    atmosphere  { type calculated; value uniform 101325; }
    walls       { type calculated; value uniform 131178.038592; }
    frontAndBack { type empty; }
}
