tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/0.orig/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 131178.038592;

boundaryField
{
    waterInlet
    {
        type            prghPressure;
        p               uniform 131667.753792;
        value           uniform 131667.753792;
    }
    waterOutlet
    {
        type            prghPressure;
        p               uniform 131178.038592;
        value           uniform 131178.038592;
    }
    airInlet
    {
        type            prghPressure;
        p               uniform 130531.614528;
        value           uniform 130531.614528;
    }
    atmosphere
    {
        type            prghPressure;
        p               uniform 101325;
        value           uniform 101325;
    }
    walls
    {
        type            fixedFluxPressure;
        value           uniform 131178.038592;
    }
    frontAndBack
    {
        type            empty;
    }
}
