tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

phases          (water air);
pMin            50000;

sigma
{
    type        constant;
    sigma       0.072;
}
