tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        realizableKE;
    turbulence      on;
    printCoeffs     on;
}
