tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// x: -40 m inlet, -10 m air connection, 0 m dropshaft, +6 m outlet
// z: horizontal-pipe centreline at 0, dropshaft rim at 6.096 m
vertices
(
    (-40.000 0.00 -0.076)  // 0
    (-40.000 0.00  0.076)  // 1
    (-40.000 0.01 -0.076)  // 2
    (-40.000 0.01  0.076)  // 3

    (-10.100 0.00 -0.076)  // 4
    (-10.100 0.00  0.076)  // 5
    (-10.100 0.01 -0.076)  // 6
    (-10.100 0.01  0.076)  // 7

    ( -9.900 0.00 -0.076)  // 8
    ( -9.900 0.00  0.076)  // 9
    ( -9.900 0.01 -0.076)  // 10
    ( -9.900 0.01  0.076)  // 11

    ( -0.076 0.00 -0.076)  // 12
    ( -0.076 0.00  0.076)  // 13
    ( -0.076 0.01 -0.076)  // 14
    ( -0.076 0.01  0.076)  // 15

    (  0.076 0.00 -0.076)  // 16
    (  0.076 0.00  0.076)  // 17
    (  0.076 0.01 -0.076)  // 18
    (  0.076 0.01  0.076)  // 19

    (  6.000 0.00 -0.076)  // 20
    (  6.000 0.00  0.076)  // 21
    (  6.000 0.01 -0.076)  // 22
    (  6.000 0.01  0.076)  // 23

    ( -0.076 0.00  6.096)  // 24
    ( -0.076 0.01  6.096)  // 25
    (  0.076 0.00  6.096)  // 26
    (  0.076 0.01  6.096)  // 27
);

blocks
(
    hex (0 4 6 2 1 5 7 3)        (598 1 12) simpleGrading (1 1 1)
    hex (4 8 10 6 5 9 11 7)      (16 1 12)  simpleGrading (1 1 1)
    hex (8 12 14 10 9 13 15 11)  (196 1 12) simpleGrading (1 1 1)
    hex (12 16 18 14 13 17 19 15) (12 1 12) simpleGrading (1 1 1)
    hex (16 20 22 18 17 21 23 19) (118 1 12) simpleGrading (1 1 1)
    hex (13 17 19 15 24 26 27 25) (12 1 474) simpleGrading (1 1 1)
);

edges ();

boundary
(
    waterInlet
    {
        type patch;
        faces ((0 1 3 2));
    }
    waterOutlet
    {
        type patch;
        faces ((20 22 23 21));
    }
    airInlet
    {
        type patch;
        faces ((5 9 11 7));
    }
    atmosphere
    {
        type patch;
        faces ((24 26 27 25));
    }
    walls
    {
        type wall;
        faces
        (
            (0 2 6 4)
            (4 6 10 8)
            (8 10 14 12)
            (12 14 18 16)
            (16 18 22 20)
            (1 5 7 3)
            (9 13 15 11)
            (17 21 23 19)
            (13 24 25 15)
            (17 19 27 26)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1) (2 3 7 6)
            (4 8 9 5) (6 7 11 10)
            (8 12 13 9) (10 11 15 14)
            (12 16 17 13) (14 15 19 18)
            (16 20 21 17) (18 19 23 22)
            (13 17 26 24) (15 25 27 19)
        );
    }
);

mergePatchPairs ();
