tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)                          Gauss vanLeer;
    div(phirb,alpha)                        Gauss linear;
    div(phi,thermo:rho.water)               Gauss upwind;
    div(phi,thermo:rho.air)                 Gauss upwind;
    div(rhoPhi,U)                           Gauss upwind;
    div(rhoPhi,T)                           Gauss upwind;
    div(rhoPhi,K)                           Gauss upwind;
    div(phi,p)                              Gauss upwind;
    div(rhoPhi,k)                           Gauss upwind;
    div(rhoPhi,epsilon)                     Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
