tests/test_04_mahywansi2024/cases/L1_fieldscale_hw050/openfoam/2d/case/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue p_rgh 101325
    volScalarFieldValue p 101325
);

regions
(
    // Initially water-filled horizontal pipe.
    boxToCell
    {
        box (-40 -1 -0.0761) (6 1 0.0761);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 131178.038592
            volScalarFieldValue p 131178.038592
        );
    }

    // Partially filled dropshaft: hw/hd = 0.50.
    boxToCell
    {
        box (-0.0761 -1 0.0759) (0.0761 1 3.048);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 131178.038592
            volScalarFieldValue p 131178.038592
        );
    }
);
